[
  {
    "img": "../img/logos/p-lang.png",
    "title": "PSec",
    "description": "PSec is a domain-specific language for programming secure distributed systems. It is a state-machine based programming language with information flow control capabilities that leverages Intel SGX enclaves to provide security guarantees at runtime. I designed and developed a secure runtime, compiler, security protocols, and trust designation system to enable state machines to be created and send messages securely across untrusted distributed hosts and channels\n\n I created this as my Master's research project at UC Berkeley as part of the Learn & Verify research lab, and the conference paper was accepted to Asia CCS '21.",
    "languages": ["cpp"],
    "status": "Started August 2019",
    "is_private": false,
    "action": "View Paper",
    "link": "https://dl.acm.org/doi/10.1145/3433210.3453113"
  },
  {
    "img": "../img/logos/apt.png",
    "bw": true,
    "title": "ACS",
    "description": "At Meta, I'm one of the core engineers working on Anonymous Credential Service (ACS). This service leverages blind signatures and other cryptographic primitivies to enable de-identified authentication at scale, serving hundreds of thousands of requests per second.\n\n I've worked all across the ACS codebase, including the C++ backend service, the Android and iOS Mobile SDKs, operational infrastrcture (e.g. alerting framework), and user portal.\n\n I co-presented ACS at the Systems@Scale 2022 conference, and helped write about it on the Meta Engineering Blog.",
    "status": "Started July 2020",
    "languages": ["cpp", "java", "objc", "python"],
    "is_private": false,
    "action": "View Blog & Presentation",
    "link": "https://engineering.fb.com/2022/03/30/security/de-identified-authentication-at-scale/"
  },
  {
    "img": "../img/logos/yearbook.png",
    "title": "Yearbook",
    "description": "YearBook is a cross-platform photo-a-day app that enables convenient documentation of activities in preschool classrooms.\n\n I helped build the Android App and we were able to deploy to the Google Play Store. Our team was eventually accepted to Free Ventures (startup accelerator) and pitched to VCs such as Sequoia and General Catalyst.",
    "status": "Started May 2017",
    "languages": ["java"],
    "is_private": false,
    "action": "Visit GitHub",
    "link": "https://github.com/ShivKushwah/Yearbook-Android-Release"
  },
  {
    "img": "../img/logos/nearme.png",
    "title": "NearMe - Android App",
    "description": "NearMe is a location app that enables you to find your friends nearby. Unlike other apps, you create hotspots or locations where you are visible to friends only when you enter them (e.g. library, gym). Otherwise, you stay anonymous.\n\n I originally came up with this idea and formed a team in MDB to deliver this idea in both iOS and Android - we published to Google Play and the Apple App Store with over 1k installs.",
    "status": "Started March 2019",
    "languages": ["java"],
    "is_private": false,
    "action": "Visit GitHub",
    "link": "https://github.com/ShivKushwah/NearMe-Android"
  },
  {
    "img": "../img/logos/deadfish.png",
    "title": "Candyland - PC Game",
    "description": "Candyland was one of my first experiences in programming, and I ended up working with friends to create a PC game. Candyland is an endless runner game, and we outfitted it with 3 total skins to change it into 3 different experiences. Check out the GitHub repo and the linked trailer for a throwback experience!",
    "status": "Started April 2019",
    "languages": ["swift"],
    "is_private": false,
    "action": "Visit GitHub",
    "link": "https://github.com/ShivKushwah/Candyland"
  }
]
